"""
https://stepik.org/lesson/2232/step/6?unit=929

Тимофей обычно спит ночью X X X часов и устраивает себе днем тихий час на Y Y Y минут. Определите,
сколько всего минут Тимофей спит в сутки.

Внимание, программа принимает значения X X X и Y Y Y из стандартного потока ввода (функция input),
результат надо выводить в стандартный поток вывода (функция print). Обратите внимание на то, что приглашение,
переданное в качестве аргумента в функцию input, считается выводом вашей программы.
Используйте эту функцию без аргументов:

values = input()  # без строки приглашения!

Для этой задачи введён корректный шаблон, так что решать ничего не нужно, разберитесь с тем, что происходит в
решении и как нужно оформлять код для сдачи его в систему.

Также обратите внимание, что в этой задаче (и во всех последующих задачах, где вам надо будет написать программу),
предлагается пример входных (Sample Input) и выходных данных (Sample Output). Вы можете использовать
эти данные для того, чтобы проверить, что ваша программа работает правильно (по крайней мере на одном примере),
и вы используете верный формат ввода-вывода (например, если в задаче несколько чисел надо вывести в одну строку, а
вы выводите каждое число на отдельной строке, то такой вывод будет считаться неверным).
Имейте в виду, что проверяться ваша программа будет на большом наборе тестов, поэтому рекомендуем вам перед
отправкой решения самостоятельно запустить вашу программу на еще каких-нибудь данных помимо примера из условия.
"""

x = int(input())
y = int(input())
print(x*60 + y)
